routes/web.php

	abort(403,"No Sticker template found for Shipmark $shipmark | $sonum, Kindly Contact BIS!");
	}

    $lists2 = DB::table('moresolist')->where('sonum', '=', $sonum)->where('trxstatus','!=','D')->where('location', '=', auth()->user()->location)->paginate(5);


    $lists3 = DB::table('users')->where('location', '=', auth()->user()->location)->where('dept', '=',"4")->whereIn('role',['16','30','25','32'])->where('status','A')->orderBy('StaffID')->get();
---
select * from `moresolist` where `sonum` = 'SO25/00006' and `trxstatus` != 'D' and `location` = 'Waterful' limit 5 offset 0
select count(*) as aggregate from `moresolist` where `sonum` = 'SO25/00006' and `trxstatus` != 'D' and `location` = 'Waterful'
select * from `users` where `location` = 'Waterful' and `dept` = '4' and `role` in ('16', '30', '25', '32') and `status` = 'A' order by `StaffID` asc